app/controllers/items_controller.rb

SELECT  "budgeters".* FROM "budgeters"  ORDER BY "budgeters"."id" ASC LIMIT 1
SELECT "items".* FROM "items"
---
	def index
		@budgeter = Budgeter.first
		@items = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "items" SET "active" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["active", "t"], ["updated_at", "2016-09-02 19:12:54.491979"], ["id", 3]]
---
	def update
		@item = Item.find(params[:id])
		if @item.active?
			@item.update(active: false)

SELECT  "budgeters".* FROM "budgeters"  ORDER BY "budgeters"."id" ASC LIMIT 1
INSERT INTO "items" ("name", "description", "price_in_pennies", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "something"], ["description", "else"], ["price_in_pennies", 1699], ["active", "t"], ["created_at", "2016-09-02 18:48:57.500145"], ["updated_at", "2016-09-02 18:48:57.500145"]]
---
	def create
		item_params = params[:item]
		@name = item_params[:name]
		@description = item_params[:description]
		@active = params[:active] || false
		@price_in_pennies = params[:price_in_pennies]
		budgeter = Budgeter.first
		@budgeter_id = budgeter.id
		@item = Item.create!(name: @name, description: @description, price_in_pennies: @price_in_pennies, active: @active, budgeter_id: @budgeter_id)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", nil]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 2]]
---
	def destroy
		@item = Item.find(params[:id])
		@item.delete